docs/vehicle_ontology.md
```mermaid
classDiagram 
   class PhysicalObject~core~{
   } 
   class Part~vehicle~{
   } 
   class Vehicle~vehicle~{
       mileage integer
       operatingHours integer
       vehicleIdentificationNumber string
   } 
   Vehicle --> Part : hasPart
   Part --> Part : hasSubpart
   Part --|> PhysicalObject
   Vehicle --|> PhysicalObject

```  
